#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_policy.ssm_worker_policy: Refreshing state... [id=arn:aws:iam::767398122881:policy/rs-ssm-worker-policy-dev]
aws_vpc.main: Refreshing state... [id=vpc-0133dcfc5fe75131b]
aws_iam_role.controlplane_role: Refreshing state... [id=rs-controlplane-role-dev]
aws_iam_policy.ssm_controlplane_read_policy: Refreshing state... [id=arn:aws:iam::767398122881:policy/rs-ssm-controlplane-read-policy-dev]
data.aws_ami.ubuntu: Reading...
aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=/aws/vpc/flow-logs]
aws_iam_policy.ssm_controlplane_write_policy: Refreshing state... [id=arn:aws:iam::767398122881:policy/rs-ssm-controlplane-write-policy-dev]
aws_iam_role.vpc_flow_logs_role: Refreshing state... [id=rs-vpc-flow-logs-role-dev]
aws_kms_key.cloudwatch: Refreshing state... [id=df8598bf-9f78-4333-a780-9d7080e509d5]
aws_iam_role.worker_role: Refreshing state... [id=rs-worker-role-dev]
data.aws_ssm_parameter.ssh_key: Reading...
aws_iam_policy.ssm_bastion_policy: Refreshing state... [id=arn:aws:iam::767398122881:policy/rs-ssm-bastion-policy-dev]
aws_iam_role.bastion_role: Refreshing state... [id=rs-bastion-role-dev]
aws_iam_role_policy_attachment.vpc_flow_logs_policy: Refreshing state... [id=rs-vpc-flow-logs-role-dev-20250630210202279500000001]
aws_eip.nat: Refreshing state... [id=eipalloc-0a70b3729865b3984]
aws_iam_role_policy_attachment.ssm_controlplane_write_policy_attach: Refreshing state... [id=rs-controlplane-role-dev-20250630210202378000000004]
aws_iam_instance_profile.controlplane_profile: Refreshing state... [id=rs-controlplane-instance-profile-dev]
aws_iam_role_policy_attachment.ssm_controlplane_read_policy_attach: Refreshing state... [id=rs-controlplane-role-dev-20250630210202309800000003]
aws_iam_instance_profile.worker_profile: Refreshing state... [id=rs-worker-instance-profile-dev]
aws_iam_role_policy_attachment.ssm_worker_policy_attach: Refreshing state... [id=rs-worker-role-dev-20250630210202504700000005]
aws_iam_instance_profile.bastion_profile: Refreshing state... [id=rs-bastion-instance-profile-dev]
aws_iam_role_policy_attachment.ssm_bastion_policy_attach: Refreshing state... [id=rs-bastion-role-dev-20250630210202306300000002]
data.aws_ssm_parameter.ssh_key: Read complete after 0s [id=/development/ssh_key]
local_file.ssh_key: Refreshing state... [id=4edc0d98a397011e99505d24aad17357304656d0]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-03b371d239dfe4af4]
aws_internet_gateway.igw: Refreshing state... [id=igw-07b3c07800dc19bfb]
aws_subnet.private[1]: Refreshing state... [id=subnet-0fa401ea048e3cef8]
aws_flow_log.vpc_flow: Refreshing state... [id=fl-058597d1be6ace182]
aws_subnet.private[0]: Refreshing state... [id=subnet-06d0b751de4e704f8]
aws_security_group.bastion_sg: Refreshing state... [id=sg-00703d410cdc32ddd]
aws_security_group.vm_public_sg: Refreshing state... [id=sg-03836e606a6e092e6]
aws_security_group.vm_private_sg: Refreshing state... [id=sg-001803a263f22819e]
aws_subnet.public[1]: Refreshing state... [id=subnet-040cfed2895a340be]
aws_subnet.public[0]: Refreshing state... [id=subnet-07b49c354f9aaf947]
aws_network_acl.private: Refreshing state... [id=acl-06e937dd90a4ccc0d]
aws_route_table.public: Refreshing state... [id=rtb-0409d16b5b16ee03d]
aws_instance.k3s_control_plane: Refreshing state... [id=i-0350804845330907f]
aws_instance.k3s_worker: Refreshing state... [id=i-0c939f9a2fe32f9c5]
aws_nat_gateway.natgw: Refreshing state... [id=nat-040982f4829e8fb86]
aws_network_acl.public: Refreshing state... [id=acl-0b3a3efebbe799d11]
aws_instance.bastion: Refreshing state... [id=i-0e460361a16fe0ab5]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0737d83424b53bd39]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-096b84c2c57543826]
aws_network_acl_rule.private_outbound_all: Refreshing state... [id=nacl-2526576459]
aws_network_acl_rule.private_inbound_ephemeral: Refreshing state... [id=nacl-3249647187]
aws_network_acl_rule.private_inbound_all_vpc: Refreshing state... [id=nacl-3125199866]
aws_network_acl_rule.private_inbound_icmp_vpc: Refreshing state... [id=nacl-2592368586]
aws_route_table.private: Refreshing state... [id=rtb-0d28e513dccf3277d]
aws_network_acl_rule.public_outbound_all: Refreshing state... [id=nacl-26263889]
aws_network_acl_rule.public_inbound_all: Refreshing state... [id=nacl-1202926142]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0339b190e4768c6e6]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-002f0bb7b81c8f2c8]
null_resource.provision_k3s_control_plane: Refreshing state... [id=8617668403698724510]
null_resource.provision_k3s_worker: Refreshing state... [id=2818577130776097132]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_security_group.vm_public_sg will be updated in-place
  ~ resource "aws_security_group" "vm_public_sg" {
        id                     = "sg-03836e606a6e092e6"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow all from VPC CIDR"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
            # (2 unchanged elements hidden)
        ]
        name                   = "rs-sg-public-vm-dev"
        tags                   = {
            "Name" = "rs-sg-public-vm-dev"
        }
        # (8 unchanged attributes hidden)
    }

  # local_file.ssh_key will be created
  + resource "local_file" "ssh_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "./blackbird.pem"
      + id                   = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "output.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @isbelevtsov, Action: `pull_request`, Working Directory: `task_3/project`, Workflow: `Terraform Plan and Apply`*